In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('Car Sales Missing Data.csv')

In [5]:
df.head()

     Make Colour  Odometer (KM)  Doors      Price
0  Nissan  Black        10148.0    4.0  Rs1366850
1  Toyota  White        10217.0    4.0  Rs1144150
2  Toyota  White        10247.0    4.0  Rs1628300
3   Honda  White        10953.0    4.0   Rs831800
4  Nissan   Blue        10954.0    4.0  Rs1521950

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           951 non-null    object
 1   Colour         950 non-null    object
 2   Odometer (KM)  950 non-null    float64
 3   Doors          950 non-null    float64
 4   Price          950 non-null    object
dtypes: float64(2), object(3)
memory usage: 39.2+ KB

In [11]:
df.describe(include='all')

          Make Colour  Odometer (KM)       Doors     Price
count      951    950     950.000000  950.000000       950
unique       4      5            NaN         NaN       934
top     Toyota  White            NaN         NaN  Rs198700
freq       379    390            NaN         NaN         2
mean       NaN    NaN  131253.237895    4.011579       NaN
std        NaN    NaN   69094.857187    0.382539       NaN
min        NaN    NaN   10148.000000    3.000000       NaN
25%        NaN    NaN   70391.250000    4.000000       NaN
50%        NaN    NaN  131821.000000    4.000000       NaN
75%        NaN    NaN  192668.500000    4.000000       NaN
max        NaN    NaN  249860.000000    5.000000       NaN

In [13]:
df.isnull().count()

Make             1000
Colour           1000
Odometer (KM)    1000
Doors            1000
Price            1000
dtype: int64

In [14]:
df.isnull().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [15]:
avg_meter = df['Odometer (KM)'].mean()
print(avg_meter)

131253.23789473684

In [16]:
df['Odometer (KM)'].replace(np.nan, avg_meter, inplace=True)

In [17]:
df['Odometer (KM)'].fillna(avg_meter, inplace=True)

In [18]:
df.isnull().sum()

Make             49
Colour           50
Odometer (KM)     0
Doors            50
Price            50
dtype: int64

In [21]:
odometer_mode = df['Odometer (KM)'].median()
odometer_mode

131253.23789473684

In [22]:
df.isnull().any()

Make              True
Colour            True
Odometer (KM)    False
Doors             True
Price             True
dtype: bool

In [23]:
df.dtypes

Make              object
Colour            object
Odometer (KM)    float64
Doors            float64
Price             object
dtype: object

In [25]:
df['Price'] = df['Price'].replace('Rs', '', regex=True)

In [26]:
df['Price'] = df['Price'].astype('float')

In [27]:
df['Odometer (KM)'].fillna(avg_meter, inplace=True)

In [28]:
df.isnull().sum()

Make             49
Colour           50
Odometer (KM)     0
Doors            50
Price            50
dtype: int64